zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKW21Z4/MKW21Z4.svd
        <register>
          <name>PACKET_RAM_0_486</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3CC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_487</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3CE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_488</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3D0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_489</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3D2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_490</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3D4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_491</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3D6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_492</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3D8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_493</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3DA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_494</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3DC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_495</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3DE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_496</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3E0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_497</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3E2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_498</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3E4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_499</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3E6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_500</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3E8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_501</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3EA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_502</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3EC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_503</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3EE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_504</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3F0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_505</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3F2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_506</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3F4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_507</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3F6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_508</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3F8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_509</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3FA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_510</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3FC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_511</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x3FE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_0_512</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x400</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LSBYTE</name>
              <description>LSBYTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBYTE</name>
              <description>MSBYTE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
